### Target Guided ordinal encoding

In [4]:
import pandas as pd
df=pd.DataFrame({
    'city':['New York','Lodon','Paris','Tokyo','New York','Paris'],
    'price': [200,150,300,250,180,320]
})
df

       city  price
0  New York    200
1     Lodon    150
2     Paris    300
3     Tokyo    250
4  New York    180
5     Paris    320

In [5]:
mean_price=df.groupby('city')['price'].mean().to_dict()
mean_price

{'Lodon': 150.0, 'New York': 190.0, 'Paris': 310.0, 'Tokyo': 250.0}

In [ ]:
df['city_encoded']=df['city'].map(mean_price)
df ## Now i can replace city with its mean
df[['price','city_encoded']] ## I ccan just give this for my model for training

   price  city_encoded
0    200         190.0
1    150         150.0
2    300         310.0
3    250         250.0
4    180         190.0
5    320         310.0